Kirseline/PCB-OVEN/Firmware/Core/Inc/stm32_ssd1306_i2c.h
/*
* Bare minimum display driver for GEVA project, no fancy dispaly scrolling etc.., just setup and Display RAM update
* Based upon the work of Derk Steggewentz
*
* Kiriaus 15/7/22
*/
#ifndef _SSD1306_STM32_
#define _SSD1306_STM32_
    

#include <stdint.h>
#include "stm32f0xx_hal.h"
#include "GEVA.h"

#define TRANSFER_ERROR    (0xFFu)    

#define SSD1306_SETCONTRAST 0x81
#define SSD1306_DISPLAYALLON_RESUME 0xA4
#define SSD1306_DISPLAYALLON 0xA5
#define SSD1306_NORMALDISPLAY 0xA6
#define SSD1306_INVERTDISPLAY 0xA7
#define SSD1306_DISPLAYOFF 0xAE
#define SSD1306_DISPLAYON 0xAF
#define SSD1306_SETDISPLAYOFFSET 0xD3
#define SSD1306_SETCOMPINS 0xDA
#define SSD1306_SETVCOMDETECT 0xDB
#define SSD1306_SETDISPLAYCLOCKDIV 0xD5
#define SSD1306_SETPRECHARGE 0xD9
#define SSD1306_SETMULTIPLEX 0xA8
#define SSD1306_SETLOWCOLUMN 0x00
#define SSD1306_SETHIGHCOLUMN 0x10
#define SSD1306_SETSTARTLINE 0x40
#define SSD1306_MEMORYMODE 0x20
#define SSD1306_COLUMNADDR 0x21
#define SSD1306_PAGEADDR 0x22
#define SSD1306_COMSCANINC 0xC0
#define SSD1306_COMSCANDEC 0xC8
#define SSD1306_SEGREMAP 0xA0
#define SSD1306_CHARGEPUMP 0x8D
#define SSD1306_EXTERNALVCC 0x1
#define SSD1306_SWITCHCAPVCC 0x2
#define SSD1306_ACTIVATE_SCROLL 0x2F
#define SSD1306_DEACTIVATE_SCROLL 0x2E
    
void init_display(uint8_t addr, I2C_HandleTypeDef *i2c_handler);
void update_display(video_buffer *buf);

#endif